In [22]:
from sqlalchemy import create_engine
from minio import Minio
import pandas as pd
import duckdb
import os
import io
from datetime import datetime, timedelta
import psycopg2

In [23]:
postgres_conn = psycopg2.connect(user="oltp",
                                  password="oltp",
                                  host="localhost",
                                  port="5432",
                                  database="oltp")

In [3]:
conn = duckdb.connect('~/my-first-elt-project/docker/db/duckdb/duckdb_dw.duckdb')

In [4]:
client = Minio(endpoint="localhost:9000", access_key='a5926TSNVC2r9J4Y2Eqh', secret_key='3YBQqcerjz5TsV8X851gi3Rl7YNclYQ6UD1MrEPY', secure=False)

In [5]:
engine = create_engine(
    'postgresql+psycopg2://oltp:oltp@localhost:5432/oltp'
)

In [6]:
#DEFINITIONS
tbl_list = ['users', 'products', 'transactions', 'transaction_detail']
bucket_name = 'snapshot'

#DEFINE CURRENT TIME VARIABLES
current_dt_string = datetime.now()
current_date_full = current_dt_string.strftime("%d%m%Y%H%M%S")
current_year = current_dt_string.strftime("%Y")
current_month = current_dt_string.strftime("%m")
current_date = current_dt_string.strftime("%d")

#DEFINE PREVIOUS DAY TIME VARIABLES

prev_dt_string = current_dt_string - timedelta(days=1)
prev_full_date = prev_dt_string.strftime("%d%m%Y%H%M%S")
prev_year = prev_dt_string.strftime("%Y") # prev_year means that the year that last day's data was on, not literally 'last year'
prev_month = prev_dt_string.strftime("%m") # the same rule applies for prev_month and prev_date.
prev_date = prev_dt_string.strftime("%d")

#DEFINE T-2 DAY TIME VARIABLES
t2_dt_string = prev_dt_string - timedelta(days=1)
t2_full_date = prev_dt_string.strftime("%d%m%Y%H%M%S")
t2_year = prev_dt_string.strftime("%Y") # prev_year means that the year that last day's data was on, not literally 'last year'
t2_month = prev_dt_string.strftime("%m") # the same rule applies for prev_month and prev_date.
t2_date = prev_dt_string.strftime("%d")

In [7]:

def create_df_for_t1_day(table_name):
    df_t1 = pd.DataFrame()
    table = table_name
    # for table in tbl_list:
        # t1_dt_obj_list = client.list_objects(bucket_name=bucket_name, prefix=f'{bucket_name}/{table}/2024/06/08/')
    t1_dt_obj_list = client.list_objects(bucket_name=bucket_name, prefix=f'{bucket_name}/{table}/{prev_year}/{prev_month}/{prev_date}/')
    for obj in t1_dt_obj_list:            
        file_path = os.path.basename(obj.object_name)
        object_key = obj.object_name
        print(f'object_key: {object_key}, file_path: {file_path}')

        try:
            response_t1 = client.get_object(bucket_name,object_name=object_key)
            buffer = io.BytesIO(response_t1.read())
            df = pd.read_parquet(buffer)
            df_t1 = pd.concat([df_t1, df], ignore_index=True) #.reset_index(drop=True)
            print(df_t1)       
        
        finally:
            response_t1.close()
            buffer.close()
            response_t1.release_conn()
    return df_t1

In [8]:
def create_df_for_t2_day(table_name):
    df_t2 = pd.DataFrame()
    table = table_name
    # for table in tbl_list:
    t2_dt_obj_list = client.list_objects(bucket_name=bucket_name, 
                                         prefix=f'{bucket_name}/{table}/{t2_year}/{t2_month}/{t2_date}/')
    for obj in t2_dt_obj_list:            
        file_path = os.path.basename(obj.object_name)
        object_key = obj.object_name
        print(f'object_key: {object_key}, file_path: {file_path}')

        try:
            response_t2 = client.get_object(bucket_name, object_name=object_key)
            buffer = io.BytesIO(response_t2.read())
            df = pd.read_parquet(buffer)
            df_t2 = pd.concat([df_t2, df], ignore_index=True)
            print(df_t2)       
            
        finally:
            response_t2.close()
            buffer.close()
            response_t2.release_conn()
    return df_t2

In [9]:
def create_df_for_changes(table_name):
    tbl = table_name
    df1 = create_df_for_t1_day(tbl)
    df2= create_df_for_t2_day(tbl)
    changes = df1[~df1.apply(tuple, 1).isin(df2.apply(tuple, 1))]
    return changes

In [10]:
conn = duckdb.connect('~/my-first-elt-project/docker/db/duckdb/duckdb_dw.duckdb')

In [36]:
def get_primary_key_columns(table_name):
    query = f"""
    SELECT a.attname as key_name
    FROM   pg_index i
    JOIN   pg_attribute a ON a.attrelid = i.indrelid
                        AND a.attnum = ANY(i.indkey)
    WHERE  i.indrelid = '{table_name}'::regclass
    AND    i.indisprimary
    """
    cur = postgres_conn.cursor()
    result = cur.execute(query)
    col_tuple = cur.fetchall() #this returns a list of tuples [('id',), ('name',), ('email',), ('created_at',)]
    col_list = [t[0] for t in col_tuple]
    return col_list

In [38]:
def upsert_sql(df, table_name):
    a = []
    target_table_name = table_name
    temp_table = f"{table_name}_temporary_table"
    key_name = get_primary_key_columns(table_name)
    for col in df.columns:
        if col in key_name:
            continue
        a.append(f'"{col}"=EXCLUDED."{col}"')
    conn.execute(f"CREATE TABLE IF NOT EXISTS {temp_table} AS SELECT * FROM df")
    conn.execute(f"INSERT INTO {temp_table} SELECT * FROM df")
    
    #df.to_sql(temp_table, engine, if_exists='replace', index=False) 
    set_statement = ', '.join(a)
    upsert_query = f"""
    WITH primary_col_extract AS (
        SELECT a.attname as key_name
        FROM   pg_index i
        JOIN   pg_attribute a ON a.attrelid = i.indrelid
                            AND a.attnum = ANY(i.indkey)
        WHERE  i.indrelid = {target_table_name}::regclass
        AND    i.indisprimary
    )
    INSERT INTO {target_table_name} as tt 
    SELECT * FROM {temp_table} as tmp
    ON CONFLICT
    DO UPDATE SET """
    # combined_query = upsert_query
    print(upsert_query + set_statement)
    conn.execute(upsert_query + set_statement)

In [12]:
conn = duckdb.connect('~/my-first-elt-project/docker/db/duckdb/duckdb_dw.duckdb')
def create_fact_table():
    conn.execute(""" CREATE TABLE IF NOT EXISTS facts (
                        id VARCHAR(255) PRIMARY KEY,
                        transaction_date TIMESTAMP NOT NULL,
                        total_amount FLOAT NOT NULL,
                        cash_received FLOAT NOT NULL,
                        change_due FLOAT NOT NULL,
                        user_id VARCHAR(255) REFERENCES users(id),
                        product_id VARCHAR(255) REFERENCES products(id),
                        quantity INTEGER NOT NULL,
                        item_amount FLOAT NOT NULL
                    )               
                    """)
    return

In [44]:
def insert_into_fact_table(df):
    fact_df = df
    conn.execute(""" INSERT INTO facts(id,user_id,product_id,transaction_date,total_amount,item_amount,quantity,cash_received,change_due)
                 SELECT id,user_id,product_id,transaction_date,fd.total_amount_x,fd.total_amount_y,quantity,cash_received,change_due FROM fact_df fd
                 
                 """)
    return

In [42]:
def elt_process():
    with open('/home/admin/my-first-elt-project/docker/db/oltp_schema.sql', 'r') as file:
        sql_script = file.read()
    conn.execute(sql_script)
    create_fact_table()
    for t in tbl_list:
        if t in ['users', 'products']:
            change_df = create_df_for_changes(t)
            upsert_sql(change_df,t)
        
        elif t == 'transactions':
            trans_df = create_df_for_changes(t)
        elif t == 'transaction_detail':
            details_df = create_df_for_changes(t)
            facts = pd.merge(details_df, trans_df, how='inner', on=[details_df['transaction_id'], trans_df['id']])
            print(facts)
            insert_into_fact_table(facts)
    conn.close()
    print('data has been upserted successfully')

In [14]:
df = pd.DataFrame({
    'column1': [1, 2, 3],
    'column2': ['A', 'B', 'C'],
    'column3': [1.1, 2.2, 3.3]
})

a= ', '.join([f'"{col}" = EXCLUDED."{col}"' for col in df.columns])
b = f"""
    WITH primary_col_extract AS (
        SELECT a.attname as key_name
        FROM   pg_index i
        JOIN   pg_attribute a ON a.attrelid = i.indrelid
                            AND a.attnum = ANY(i.indkey)
        WHERE  i.indrelid = {tbl_list}::regclass
        AND    i.indisprimary
    )
    INSERT INTO {tbl_list} as tt 
    SELECT * FROM {tbl_list} as tmp
    ON CONFLICT
    DO UPDATE SET """
print(b + a)

    WITH primary_col_extract AS (
        SELECT a.attname as key_name
        FROM   pg_index i
        JOIN   pg_attribute a ON a.attrelid = i.indrelid
                            AND a.attnum = ANY(i.indkey)
        WHERE  i.indrelid = ['users', 'products', 'transactions', 'transaction_detail']::regclass
        AND    i.indisprimary
    )
    INSERT INTO ['users', 'products', 'transactions', 'transaction_detail'] as tt
    SELECT * FROM ['users', 'products', 'transactions', 'transaction_detail'] as tmp
    ON CONFLICT
    DO UPDATE SET "column1" = EXCLUDED."column1", "column2" = EXCLUDED."column2", "column3" = EXCLUDED."column3"

In [45]:
elt_process()

object_key: snapshot/users/2024/06/20/users_snapshot_20062024200713.parquet, file_path: users_snapshot_20062024200713.parquet
          id             name                         email  \
0     IZ6732     EUGENE HUANG  eugene10@adventure-works.com
1     GT9653   BLAKE ANDERSON         bakerjody@example.net
2     PM2183   Amber Anderson          kimbrett@example.org
3     ZZ7643           AMY YE          amanda67@example.net
4     WS4471  WENDY DOMINGUEZ     roblesdouglas@example.com
...      ...              ...                           ...
4524  NX5658      Brian Walsh           sjuarez@example.com
4525  DS1012    Daniel Baxter       danielscott@example.com
4526  UA3742      Kristy Chan       pricemarvin@example.org
4527  FV4309      Jamie Barry            oadams@example.com
4528  OT4782  Michael Stevens              alee@example.org

              created_at
0    2024-05-15 13:34:00
1    2024-05-15 18:30:00
2    2024-06-18 07:01:01
3    2024-05-15 18:18:00
4    2024-05-15 15:46:00
...                  ...
4524 2024-06-21 20:01:01
4525 2024-06-21 20:01:01
4526 2024-06-21 20:01:01
4527 2024-06-21 20:01:01
4528 2024-06-21 20:01:01

[4529 rows x 4 columns]
object_key: snapshot/users/2024/06/20/users_snapshot_20062024200713.parquet, file_path: users_snapshot_20062024200713.parquet
          id             name                         email  \
0     IZ6732     EUGENE HUANG  eugene10@adventure-works.com
1     GT9653   BLAKE ANDERSON         bakerjody@example.net
2     PM2183   Amber Anderson          kimbrett@example.org
3     ZZ7643           AMY YE          amanda67@example.net
4     WS4471  WENDY DOMINGUEZ     roblesdouglas@example.com
...      ...              ...                           ...
4524  NX5658      Brian Walsh           sjuarez@example.com
4525  DS1012    Daniel Baxter       danielscott@example.com
4526  UA3742      Kristy Chan       pricemarvin@example.org
4527  FV4309      Jamie Barry            oadams@example.com
4528  OT4782  Michael Stevens              alee@example.org

              created_at
0    2024-05-15 13:34:00
1    2024-05-15 18:30:00
2    2024-06-18 07:01:01
3    2024-05-15 18:18:00
4    2024-05-15 15:46:00
...                  ...
4524 2024-06-21 20:01:01
4525 2024-06-21 20:01:01
4526 2024-06-21 20:01:01
4527 2024-06-21 20:01:01
4528 2024-06-21 20:01:01

[4529 rows x 4 columns]

    WITH primary_col_extract AS (
        SELECT a.attname as key_name
        FROM   pg_index i
        JOIN   pg_attribute a ON a.attrelid = i.indrelid
                            AND a.attnum = ANY(i.indkey)
        WHERE  i.indrelid = users::regclass
        AND    i.indisprimary
    )
    INSERT INTO users as tt
    SELECT * FROM users_temporary_table as tmp
    ON CONFLICT
    DO UPDATE SET "name"=EXCLUDED."name", "email"=EXCLUDED."email", "created_at"=EXCLUDED."created_at"
object_key: snapshot/products/2024/06/20/products_snapshot_20062024200713.parquet, file_path: products_snapshot_20062024200713.parquet
             id                   product_name  unit_price           category
0     HL-U509-R          Sport-100 Helmet, Red       34.99          Sport-100
1    FR-R72R-44        ML Road Frame - Red, 44      594.83      ML Road Frame
2    FR-R72R-48        ML Road Frame - Red, 48      594.83      ML Road Frame
3    FR-R72R-52        ML Road Frame - Red, 52      594.83      ML Road Frame
4    FR-R72R-60        ML Road Frame - Red, 60      594.83      ML Road Frame
..          ...                            ...         ...                ...
190  BK-M18B-44         Mountain-500 Black, 44      378.22       Mountain-500
191  FR-M21B-42  LL Mountain Frame - Black, 42      170.91  LL Mountain Frame
192  BK-R89R-58               Road-250 Red, 58       83.74           Road-250
193     CL-9009          Bike Wash - Dissolver     1742.86          Bike Wash
194     BC-R205               Road Bottle Cage       85.54   Road Bottle Cage

[195 rows x 4 columns]
object_key: snapshot/products/2024/06/20/products_snapshot_20062024200713.parquet, file_path: products_snapshot_20062024200713.parquet
             id                   product_name  unit_price           category
0     HL-U509-R          Sport-100 Helmet, Red       34.99          Sport-100
1    FR-R72R-44        ML Road Frame - Red, 44      594.83      ML Road Frame
2    FR-R72R-48        ML Road Frame - Red, 48      594.83      ML Road Frame
3    FR-R72R-52        ML Road Frame - Red, 52      594.83      ML Road Frame
4    FR-R72R-60        ML Road Frame - Red, 60      594.83      ML Road Frame
..          ...                            ...         ...                ...
190  BK-M18B-44         Mountain-500 Black, 44      378.22       Mountain-500
191  FR-M21B-42  LL Mountain Frame - Black, 42      170.91  LL Mountain Frame
192  BK-R89R-58               Road-250 Red, 58       83.74           Road-250
193     CL-9009          Bike Wash - Dissolver     1742.86          Bike Wash
194     BC-R205               Road Bottle Cage       85.54   Road Bottle Cage

[195 rows x 4 columns]

    WITH primary_col_extract AS (
        SELECT a.attname as key_name
        FROM   pg_index i
        JOIN   pg_attribute a ON a.attrelid = i.indrelid
                            AND a.attnum = ANY(i.indkey)
        WHERE  i.indrelid = products::regclass
        AND    i.indisprimary
    )
    INSERT INTO products as tt
    SELECT * FROM products_temporary_table as tmp
    ON CONFLICT
    DO UPDATE SET "product_name"=EXCLUDED."product_name", "unit_price"=EXCLUDED."unit_price", "category"=EXCLUDED."category"
object_key: snapshot/transactions/2024/06/20/transactions_snapshot_20062024200713.parquet, file_path: transactions_snapshot_20062024200713.parquet
           id    transaction_date  total_amount  cash_received  change_due  \
0    WY812221 2024-05-16 10:12:00        485.96          563.0       77.04
1    MA377489 2024-05-16 10:20:00       1444.46         1518.0       73.54
2    LO599271 2024-05-16 10:28:00        121.49          155.0       33.51
3    GW967753 2024-05-16 10:36:00        485.96          550.0       64.04
4    ZC228626 2024-05-16 10:44:00        242.98          336.0       93.02
..        ...                 ...           ...            ...         ...
275  TO565707 2024-06-21 20:01:01       3493.29         3573.0       79.71
276  GD102931 2024-06-21 20:01:02       1654.49         1706.0       51.51
277  EV716018 2024-06-21 20:01:02        132.27          179.0       46.73
278  VG019911 2024-06-21 20:01:02         75.00           81.0        6.00
279  AY391431 2024-06-21 20:01:02       1420.01         1434.0       13.99

    user_id
0    IZ6732
1    WB7662
2    SU7989
3    YZ6738
4    MV5719
..      ...
275  EG2610
276  IJ1877
277  BN9715
278  QZ1434
279  YJ6260

[280 rows x 6 columns]
object_key: snapshot/transactions/2024/06/20/transactions_snapshot_20062024200713.parquet, file_path: transactions_snapshot_20062024200713.parquet
           id    transaction_date  total_amount  cash_received  change_due  \
0    WY812221 2024-05-16 10:12:00        485.96          563.0       77.04
1    MA377489 2024-05-16 10:20:00       1444.46         1518.0       73.54
2    LO599271 2024-05-16 10:28:00        121.49          155.0       33.51
3    GW967753 2024-05-16 10:36:00        485.96          550.0       64.04
4    ZC228626 2024-05-16 10:44:00        242.98          336.0       93.02
..        ...                 ...           ...            ...         ...
275  TO565707 2024-06-21 20:01:01       3493.29         3573.0       79.71
276  GD102931 2024-06-21 20:01:02       1654.49         1706.0       51.51
277  EV716018 2024-06-21 20:01:02        132.27          179.0       46.73
278  VG019911 2024-06-21 20:01:02         75.00           81.0        6.00
279  AY391431 2024-06-21 20:01:02       1420.01         1434.0       13.99

    user_id
0    IZ6732
1    WB7662
2    SU7989
3    YZ6738
4    MV5719
..      ...
275  EG2610
276  IJ1877
277  BN9715
278  QZ1434
279  YJ6260

[280 rows x 6 columns]
object_key: snapshot/transaction_detail/2024/06/20/transaction_detail_snapshot_20062024200713.parquet, file_path: transaction_detail_snapshot_20062024200713.parquet
    transaction_id  product_id  quantity  total_amount
0         WY812221     TT-R982         2        242.98
1         WY812221   HL-U509-R         1        121.49
2         WY812221     TI-R982         1        121.49
3         MA377489     TT-R982         2        242.98
4         MA377489  BK-R89B-52         1       1079.99
..             ...         ...       ...           ...
526       EV716018     PD-M340         2        105.30
527       VG019911     LO-C100         3         75.00
528       AY391431  FR-M21B-48         2        499.58
529       AY391431  FR-M21S-48         3        792.15
530       AY391431   SH-M897-S         3        128.28

[531 rows x 4 columns]
object_key: snapshot/transaction_detail/2024/06/20/transaction_detail_snapshot_20062024200713.parquet, file_path: transaction_detail_snapshot_20062024200713.parquet
    transaction_id  product_id  quantity  total_amount
0         WY812221     TT-R982         2        242.98
1         WY812221   HL-U509-R         1        121.49
2         WY812221     TI-R982         1        121.49
3         MA377489     TT-R982         2        242.98
4         MA377489  BK-R89B-52         1       1079.99
..             ...         ...       ...           ...
526       EV716018     PD-M340         2        105.30
527       VG019911     LO-C100         3         75.00
528       AY391431  FR-M21B-48         2        499.58
529       AY391431  FR-M21S-48         3        792.15
530       AY391431   SH-M897-S         3        128.28

[531 rows x 4 columns]
Empty DataFrame
Columns: [key_0, key_1, transaction_id, product_id, quantity, total_amount_x, id, transaction_date, total_amount_y, cash_received, change_due, user_id]
Index: []
data has been upserted successfully